7. 그룹 분석

In [1]:
import numpy as np
import pandas as pd

In [ ]:
#### 1. Pivot table

In [ ]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

In [ ]:
df1.pivot(values='인구', index='도시', columns='연도')

In [ ]:
df1.pivot_table(values='인구', index='도시', columns='연도')

In [ ]:
df1.pivot_table('인구', ['지역','도시'], '연도')

- 그룹 분석

In [ ]:
import seaborn as sns
iris = sns.load_dataset('iris')
tips = sns.load_dataset('tips')

In [ ]:
iris.head(3)

In [ ]:
iris[50:53]

In [ ]:
iris.tail(3)

In [ ]:
# 품종별 항목의 갯수
iris.groupby('species').count()

In [ ]:
# 품종별 항목의 평균
iris.groupby('species').mean()

In [ ]:
# 품종별 sepal_length(꽃받침 길이)의 평균 - 결과는 series
iris.groupby('species').mean()['sepal_length']

In [ ]:
iris.groupby('species')['sepal_length'].mean()

In [ ]:
iris[['sepal_length','species']].groupby('species').mean()

In [ ]:
# 품종별 항목의 평균과 표준편차
iris.groupby('species').agg(['mean', 'std'])

In [ ]:
# 개별 항목의 다양한 통계
iris.groupby('species')['sepal_width'].agg(['mean', 'std', 'min', 'max'])

- tips data

In [ ]:
tips['tip_pct'] = (tips.tip / tips.total_bill * 100).round(2)
tips.tail()

In [ ]:
tips.describe()

In [ ]:
# 성별, 흡연유무별 팁 비율의 평균
tips.groupby(['sex','smoker'])[['tip_pct']].mean()

In [ ]:
# 성별, 흡연유무별 팁 비율의 데이터 수, 평균, 최소, 최대
tips.groupby(['sex','smoker'])[['tip_pct']].agg(['count','mean','min','max'])

In [ ]:
# 요일별, 시간대별 팁 비율의 데이터 수, 평균, 최소, 최대
tips.groupby(['day', 'time'])[['tip_pct']].agg(['count','mean','min','max'])

2.2 pivot table

In [ ]:
# 성별, 흡연 유무별 팁의 비율
tips.pivot_table('tip_pct','sex','smoker', 'mean')

In [ ]:
# 합계 기능
# 성별, 흡연유무별 인원
tips.pivot_table('tip_pct', 'sex', 'smoker', 'count', margins=True, margins_name='계')

#### 2.3 groupby vs pivot_table

In [ ]:
# 성별 팁 비율의 평균
tips.groupby('sex')[['tip_pct']].mean()

In [1]:
tips.pivot_table('tip_pct', 'sex', aggfunc='mean')

NameError: name 'tips' is not defined

In [ ]:
tips.pivot_table('tip_pct', 'sex')

In [ ]:
# 흡연 유무에 따른 평균 팁 비율과 최소값, 최대값
tips.groupby('smoker')['tip_pct'].agg(['mean', 'min', 'max'])

In [23]:
tips.pivot_table('tip_pct', 'smoker', aggfunc=['mean', 'min', 'max'])

NameError: name 'tips' is not defined

- 연습문제 4.7.3

In [ ]:
tips.pivot_table('tip_pct', 'smoker', aggfunc=['mean', 'min', 'max'])

In [ ]:
tips.groupby('time')['tip_pct'].agg(['mean', 'std'])

In [ ]:

tips.groupby('size')['tip_pct'].agg(['mean', 'std'])

- 연습문제 4.7.4

In [7]:
# 타이타닉 승객 데이터를 이용하여다음 분석을 실시하라. 데이터는 다음과 같이 받을 수 있다
import seaborn as sns
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [8]:
#1. qcut 명령으로 세개의 나이 그룹을 만든다.
df['cat'] = pd.qcut(df.age, 3, labels=['A1', 'A2', 'A3'])

In [9]:
# 2. 성별, 선실, 나이 그룹에 의한 생존율을 데이터 프레임으로 계산한다.
#    행에는 성별 및 나이 그룹에 대한 다중 인덱스를 사용하고 열에는 선실 인덱스를 사용
df.pivot_table('survived',['sex','cat'],'class')

class          First    Second     Third
sex    cat
female A1   0.954545  1.000000  0.508475
       A2   0.947368  0.909091  0.481481
       A3   0.977273  0.857143  0.250000
male   A1   0.500000  0.357143  0.158879
       A2   0.500000  0.076923  0.195652
       A3   0.347826  0.062500  0.055556

In [10]:
df.pivot_table('survived', 'sex', 'class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

8. 시계열 자료 다루기

In [12]:
date_str = ["2023, 4, 17"]
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2023-04-17'], dtype='datetime64[ns]', freq=None)

In [13]:
idx = pd.to_datetime(['2023-04-17'], format= '%Y-%m-%d')
idx

DatetimeIndex(['2023-04-17'], dtype='datetime64[ns]', freq=None)

In [14]:
date_str = ['2023-04-17','2023-04-18','2023-04-19','2023-04-20','2023-04-21']
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2023-04-17', '2023-04-18', '2023-04-19', '2023-04-20',
               '2023-04-21'],
              dtype='datetime64[ns]', freq=None)

In [15]:
df = pd.DataFrame(np.random.randint(60, 100, 5),
                  columns=['score'], index=idx)
df

            score
2023-04-17     75
2023-04-18     69
2023-04-19     92
2023-04-20     72
2023-04-21     82

In [16]:
pd.date_range('4/1/23' , periods=30)

DatetimeIndex(['2023-04-01', '2023-04-02', '2023-04-03', '2023-04-04',
               '2023-04-05', '2023-04-06', '2023-04-07', '2023-04-08',
               '2023-04-09', '2023-04-10', '2023-04-11', '2023-04-12',
               '2023-04-13', '2023-04-14', '2023-04-15', '2023-04-16',
               '2023-04-17', '2023-04-18', '2023-04-19', '2023-04-20',
               '2023-04-21', '2023-04-22', '2023-04-23', '2023-04-24',
               '2023-04-25', '2023-04-26', '2023-04-27', '2023-04-28',
               '2023-04-29', '2023-04-30'],
              dtype='datetime64[ns]', freq='D')

In [17]:
pd.date_range('040123', periods=30, freq='B')

DatetimeIndex(['2023-04-03', '2023-04-04', '2023-04-05', '2023-04-06',
               '2023-04-07', '2023-04-10', '2023-04-11', '2023-04-12',
               '2023-04-13', '2023-04-14', '2023-04-17', '2023-04-18',
               '2023-04-19', '2023-04-20', '2023-04-21', '2023-04-24',
               '2023-04-25', '2023-04-26', '2023-04-27', '2023-04-28',
               '2023-05-01', '2023-05-02', '2023-05-03', '2023-05-04',
               '2023-05-05', '2023-05-08', '2023-05-09', '2023-05-10',
               '2023-05-11', '2023-05-12'],
              dtype='datetime64[ns]', freq='B')

In [19]:
# 1년중 각 월의 주말이 아닌 시작일 
pd.date_range('2023-1-1', '2023-12-31', freq='BMS')

DatetimeIndex(['2023-01-02', '2023-02-01', '2023-03-01', '2023-04-03',
               '2023-05-01', '2023-06-01', '2023-07-03', '2023-08-01',
               '2023-09-01', '2023-10-02', '2023-11-01', '2023-12-01'],
              dtype='datetime64[ns]', freq='BMS')

- resample

In [21]:
ts = pd.DataFrame(np.random.randint(100,1000,100),
                  index=pd.date_range('20230101', periods=100))
ts.head()

              0
2023-01-01  524
2023-01-02  536
2023-01-03  367
2023-01-04  882
2023-01-05  948

In [22]:
ts.resample('W').first()

              0
2023-01-01  524
2023-01-08  536
2023-01-15  247
2023-01-22  689
2023-01-29  694
2023-02-05  527
2023-02-12  435
2023-02-19  218
2023-02-26  332
2023-03-05  166
2023-03-12  422
2023-03-19  505
2023-03-26  796
2023-04-02  810
2023-04-09  417
2023-04-16  964